Revit 2027 API
TableCellStyle(TableCellStyle) Constructor
 Constructs a new copy of the input TableCellStyle object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableCellStyle(
	TableCellStyle other
)
Public Sub New (
	other As TableCellStyle
)
public:
TableCellStyle(
	TableCellStyle^ other
)
new :
        other : TableCellStyle -> TableCellStyle
Parameters
other TableCellStyle
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableCellStyle Class
TableCellStyle Overload
Autodesk.Revit.DB Namespace